/*! =====================================================================================
@file		NameObject.h
@brief		Class NameObject
@author
@date		2016.11.09	最終更新
====================================================================================== */
#pragma once
#include "../File/File.h"

class NameObject {
public:

	/*! =====================================================================================
	@brief	名前セット、ハッシュ値生成
	@param	名前
	@return void
	====================================================================================== */
	void SetName(tstring str) {
		m_name = str;
		m_hashCode = UT::StringToHash(str);
	}

	/*! =====================================================================================
	@brief	名前取得
	@param	void
	@return void
	====================================================================================== */
	tstring GetName()const { return m_name; }

	/*! =====================================================================================
	@brief	ハッシュ値取得
	@param	void
	@return void
	====================================================================================== */
	HASH GetHashCode()const { return m_hashCode; }

protected:
	tstring	m_name;
private:
	HASH	m_hashCode;
};