/*! =====================================================================================
@file		FadeSprite.h
@brief		2Dスプライト用ベースオブジェクト
@author		Takuya Kawakami
@date		2016.11.07	新規作成
====================================================================================== */
#pragma once
#include	"Sprite2D.h"

class FadeSprite :public	Sprite2D {
public:
	FadeSprite();
	virtual ~FadeSprite();
	void	Update();

	/*! =====================================================================================
	@brief	フェードアウト開始
	====================================================================================== */
	void	StartFadeOut();

	/*! =====================================================================================
	@brief	フェード状態取得
	@return bool:フェード中ならばtrueを返す
	====================================================================================== */
	bool	GetFadingState()const;

private:
	bool	m_bFirstFrame;	//シーン開始最初のフレーム
	bool	m_bFadeIN;		//フェードインフラグ
	bool	m_bFadeOUT;		//フェードアウトフラグ
	float	m_timer;		//フェード管理用タイマー
};
