/*! =====================================================================================
@file		MainWindow.h
@brief		MainWindowのデータへのアクセス機能をゲーム実装部（フレームワーク外）に提供するメソッドをまとめた名前空間によるインターフェース
@author		Takuya Kawakami
@date		2016.11.03	新規作成
====================================================================================== */
#pragma once

namespace MainWindow {

	/*! =====================================================================================
	@brief	ウィンドウ横幅
	@param	void
	@return unsigned int
	====================================================================================== */
	unsigned	int	GetWindowHeight();

	/*! =====================================================================================
	@brief	ウィンドウ縦幅
	@param	void
	@return unsigned int
	====================================================================================== */
	unsigned	int	GetWindowWidth();
}