	/*! =====================================================================================
@file		Console.h
@brief		コンソールへの出力マクロを提供
@author		Takuya Kawakami
@date		2016.03.15	新規作成
====================================================================================== */
#pragma once

/*! =====================================================================================
@param	printf同様の可変引数に対応
====================================================================================== */

#ifdef _DEBUG
#define	CONSOLE_OUTPUT(...)	{ char _work[1024]; sprintf_s(_work,__VA_ARGS__); printf(_work); }
#else
#define	CONSOLE_OUTPUT(...)	{}	//リリースモードでは空
#endif // _DEBUG