/*! =====================================================================================
@file		Component.h
@brief		GameObjectに所属するコンポーネントのベースクラス
@author		Takuya Kawakami
@date		2016.11.05	新規作成
====================================================================================== */
#pragma once
#include	"../BaseSystem/Public/Common/Common.h"

//前方定義
class GameObject;

class Component {
public:
	Component();
	virtual	~Component();
	virtual	void	Update() {}

	/*! =====================================================================================
	@brief	ゲームオブジェクトとこのコンポーネントを関連付け・アタッチする
	@param	GameObject*
	@return void
	====================================================================================== */
	void	Attach(GameObject* const _dest);

	/*! =====================================================================================
	@brief	このコンポーネントがアタッチしているゲームオブジェクトへのポインタを取得
	@param	void
	@return GameObject*
	====================================================================================== */
	GameObject*	GetGameObject()const;

	/*! =====================================================================================
	@brief	コンポーネントの有効・無効フラグを取得
	@param	bool：true＝有効
	====================================================================================== */
	bool		GetActiveFlg() const;

	/*! =====================================================================================
	@brief	コンポーネントの有効化・無効化
	@param	bool：true＝有効化
	====================================================================================== */
	void	Activate(bool _flg);

protected:
	GameObject*	m_pGameObject;	//このコンポーネントが所属しているゲームオブジェクトへのポインタ
	int			m_componentID;	//コンポーネント識別用ID
	bool		m_isActive;		//このコンポーネントが有効であるかのフラグ

};
