#include	"Component.h"

/*! =====================================================================================
@brief	コンストラクタ
@param	void
====================================================================================== */
Component::Component() :
	m_componentID(0), m_pGameObject(nullptr), m_isActive(true) {
}

/*! =====================================================================================
@brief	コンストラクタ
@param	GameObject*：このコンポーネントがアタッチするゲームオブジェクトへのポインタ
====================================================================================== */
Component::Component(GameObject * const _pParent) :
	m_componentID(0), m_pGameObject(_pParent), m_isActive(true) {
}

/*! =====================================================================================
@brief	デストラクタ
@param	void
====================================================================================== */
Component::~Component() {
}

/*! =====================================================================================
@brief	ゲームオブジェクトとこのコンポーネントを関連付け・アタッチする
@param	GameObject*
@return void
====================================================================================== */
void Component::Attach(GameObject * const _dest) {
	m_pGameObject = _dest;
}

/*! =====================================================================================
@brief	このコンポーネントがアタッチしているゲームオブジェクトへのポインタを取得
@param	void
@return GameObject*
====================================================================================== */
GameObject * Component::GetGameObject()const {
	return m_pGameObject;
}

/*! =====================================================================================
@brief	コンポーネントの有効・無効フラグを取得
@param	bool：true＝有効
====================================================================================== */
bool Component::GetActiveFlg() const {
	return m_isActive;
}

/*! =====================================================================================
@brief	コンポーネントの有効化・無効化
@param	bool：true＝有効化
====================================================================================== */
void Component::Activate(bool _flg) {
	m_isActive = _flg;
}
