/*! =====================================================================================
@file		Render.h
@brief		入力システムのデータへのアクセスをゲーム実装部に提供するメソッドをまとめた名前空間によるインターフェース
@author		Takuya Kawakami
@date		2016.11.03	新規作成
====================================================================================== */
#pragma once
class Camera;

namespace Render {

	/*! =====================================================================================
	@brief	メインカメラ設定
	@param	Camera*
	@return void
	====================================================================================== */
	void	SetMainCamera(Camera* _pMainCamera);



}
